Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateSystemPanel Property
 Can't create Curtain Panel in opening. The opening is probably too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateSystemPanel { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateSystemPanel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateSystemPanel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace